[Survived] BlockStatement
next-js/my-app/components/date.tsx:3:79
 import { parseISO, format } from 'date-fns';
 
-export default function DateComponent({ dateString }: { dateString: string }) {
-  const date = parseISO(dateString);
-  return <time dateTime={dateString}>{format(date, 'LLLL d, yyyy')}</time>;
-}
+export default function DateComponent({ dateString }: { dateString: string }) {}
 
 const second = 1000;

[Killed] StringLiteral
next-js/my-app/components/date.tsx:5:52
 
 export default function DateComponent({ dateString }: { dateString: string }) {
   const date = parseISO(dateString);
-  return <time dateTime={dateString}>{format(date, 'LLLL d, yyyy')}</time>;
+  return <time dateTime={dateString}>{format(date, "")}</time>;
 }
 
killedBy: Post renders the markdown content
statusReason: TypeError: Cannot read properties of null (reading 'map')

[Killed] ArithmeticOperator
next-js/my-app/components/date.tsx:9:14
 }
 
 const second = 1000;
-const hour = second * 3600;
+const hour = second / 3600;
 const day = hour * 24;
 const year = day * 365;
killedBy: DaysAgo should show years ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 years ago"
Received: "25948764 years ago"

[Killed] ArithmeticOperator
next-js/my-app/components/date.tsx:10:13
 
 const second = 1000;
 const hour = second * 3600;
-const day = hour * 24;
+const day = hour / 24;
 const year = day * 365;
 export function DaysAgo({ dateString }: { dateString: string }) {
killedBy: DaysAgo should show years ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 years ago"
Received: "1153 years ago"

[Killed] ArithmeticOperator
next-js/my-app/components/date.tsx:11:14
 const second = 1000;
 const hour = second * 3600;
 const day = hour * 24;
-const year = day * 365;
+const year = day / 365;
 export function DaysAgo({ dateString }: { dateString: string }) {
   const date = parseISO(dateString);
killedBy: DaysAgo should show years ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 years ago"
Received: "266746 years ago"

[Killed] BlockStatement
next-js/my-app/components/date.tsx:12:65
 const hour = second * 3600;
 const day = hour * 24;
 const year = day * 365;
-export function DaysAgo({ dateString }: { dateString: string }) {
-  const date = parseISO(dateString);
-  const now = new Date();
-  const diff = now.getTime() - date.getTime();
-  let desc = `${Math.round(diff / second)} seconds ago`;
-  if (diff > year) {
-    desc = agoString('year', Math.round(diff / year));
-  } else if (diff > day) {
-    desc = agoString('day', Math.round(diff / day));
-  } else if (diff > hour) {
-    desc = agoString('hour', Math.round(diff / hour));
-  }
-  return <time dateTime={dateString}>{desc}</time>;
-
-  function agoString(desc: string, amount: number) {
-    return `${amount} ${desc}${amount > 1 ? 's' : ''} ago`;
-  }
-}
+export function DaysAgo({ dateString }: { dateString: string }) {}
 
killedBy: DaysAgo should show years ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 years ago"
Received: ""

[Killed] ArithmeticOperator
next-js/my-app/components/date.tsx:15:16
 export function DaysAgo({ dateString }: { dateString: string }) {
   const date = parseISO(dateString);
   const now = new Date();
-  const diff = now.getTime() - date.getTime();
+  const diff = now.getTime() + date.getTime();
   let desc = `${Math.round(diff / second)} seconds ago`;
   if (diff > year) {
killedBy: DaysAgo should show years ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 years ago"
Received: "103 years ago"

[Survived] ArithmeticOperator
next-js/my-app/components/date.tsx:16:28
   const date = parseISO(dateString);
   const now = new Date();
   const diff = now.getTime() - date.getTime();
-  let desc = `${Math.round(diff / second)} seconds ago`;
+  let desc = `${Math.round(diff * second)} seconds ago`;
   if (diff > year) {
     desc = agoString('year', Math.round(diff / year));

[Survived] StringLiteral
next-js/my-app/components/date.tsx:16:14
   const date = parseISO(dateString);
   const now = new Date();
   const diff = now.getTime() - date.getTime();
-  let desc = `${Math.round(diff / second)} seconds ago`;
+  let desc = ``;
   if (diff > year) {
     desc = agoString('year', Math.round(diff / year));

[Killed] EqualityOperator
next-js/my-app/components/date.tsx:17:7
   const now = new Date();
   const diff = now.getTime() - date.getTime();
   let desc = `${Math.round(diff / second)} seconds ago`;
-  if (diff > year) {
+  if (diff <= year) {
     desc = agoString('year', Math.round(diff / year));
   } else if (diff > day) {
killedBy: DaysAgo should show years ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 years ago"
Received: "731 days ago"

[Killed] ConditionalExpression
next-js/my-app/components/date.tsx:17:7
   const now = new Date();
   const diff = now.getTime() - date.getTime();
   let desc = `${Math.round(diff / second)} seconds ago`;
-  if (diff > year) {
+  if (false) {
     desc = agoString('year', Math.round(diff / year));
   } else if (diff > day) {
killedBy: DaysAgo should show years ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 years ago"
Received: "731 days ago"

[Killed] ArithmeticOperator
next-js/my-app/components/date.tsx:18:41
   const diff = now.getTime() - date.getTime();
   let desc = `${Math.round(diff / second)} seconds ago`;
   if (diff > year) {
-    desc = agoString('year', Math.round(diff / year));
+    desc = agoString('year', Math.round(diff * year));
   } else if (diff > day) {
     desc = agoString('day', Math.round(diff / day));
killedBy: DaysAgo should show years ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 years ago"
Received: "1.991245362641568e+21 years ago"

[Killed] ConditionalExpression
next-js/my-app/components/date.tsx:19:14
   let desc = `${Math.round(diff / second)} seconds ago`;
   if (diff > year) {
     desc = agoString('year', Math.round(diff / year));
-  } else if (diff > day) {
+  } else if (true) {
     desc = agoString('day', Math.round(diff / day));
   } else if (diff > hour) {
killedBy: DaysAgo should show hours ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 hours ago"
Received: "0 day ago"

[Killed] ConditionalExpression
next-js/my-app/components/date.tsx:19:14
   let desc = `${Math.round(diff / second)} seconds ago`;
   if (diff > year) {
     desc = agoString('year', Math.round(diff / year));
-  } else if (diff > day) {
+  } else if (false) {
     desc = agoString('day', Math.round(diff / day));
   } else if (diff > hour) {
killedBy: DaysAgo should show days ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "48 hours ago"

[Killed] ArithmeticOperator
next-js/my-app/components/date.tsx:20:40
   if (diff > year) {
     desc = agoString('year', Math.round(diff / year));
   } else if (diff > day) {
-    desc = agoString('day', Math.round(diff / day));
+    desc = agoString('day', Math.round(diff * day));
   } else if (diff > hour) {
     desc = agoString('hour', Math.round(diff / hour));
killedBy: DaysAgo should show days ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "14929920691200000 days ago"

[Killed] EqualityOperator
next-js/my-app/components/date.tsx:21:14
     desc = agoString('year', Math.round(diff / year));
   } else if (diff > day) {
     desc = agoString('day', Math.round(diff / day));
-  } else if (diff > hour) {
+  } else if (diff <= hour) {
     desc = agoString('hour', Math.round(diff / hour));
   }
killedBy: DaysAgo should show hours ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 hours ago"
Received: "7200 seconds ago"

[Killed] ConditionalExpression
next-js/my-app/components/date.tsx:21:14
     desc = agoString('year', Math.round(diff / year));
   } else if (diff > day) {
     desc = agoString('day', Math.round(diff / day));
-  } else if (diff > hour) {
+  } else if (false) {
     desc = agoString('hour', Math.round(diff / hour));
   }
killedBy: DaysAgo should show hours ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 hours ago"
Received: "7200 seconds ago"

[Killed] ArithmeticOperator
next-js/my-app/components/date.tsx:22:41
   } else if (diff > day) {
     desc = agoString('day', Math.round(diff / day));
   } else if (diff > hour) {
-    desc = agoString('hour', Math.round(diff / hour));
+    desc = agoString('hour', Math.round(diff * hour));
   }
   return <time dateTime={dateString}>{desc}</time>;
killedBy: DaysAgo should show hours ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 hours ago"
Received: "25920025200000 hours ago"

[Killed] BlockStatement
next-js/my-app/components/date.tsx:26:52
   }
   return <time dateTime={dateString}>{desc}</time>;
 
-  function agoString(desc: string, amount: number) {
-    return `${amount} ${desc}${amount > 1 ? 's' : ''} ago`;
-  }
+  function agoString(desc: string, amount: number) {}
 }
 
killedBy: DaysAgo should show years ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 years ago"
Received: ""

[Killed] ConditionalExpression
next-js/my-app/components/date.tsx:27:32
   return <time dateTime={dateString}>{desc}</time>;
 
   function agoString(desc: string, amount: number) {
-    return `${amount} ${desc}${amount > 1 ? 's' : ''} ago`;
+    return `${amount} ${desc}${false ? 's' : ''} ago`;
   }
 }
killedBy: DaysAgo should show years ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 years ago"
Received: "2 year ago"

[Killed] EqualityOperator
next-js/my-app/components/date.tsx:27:32
   return <time dateTime={dateString}>{desc}</time>;
 
   function agoString(desc: string, amount: number) {
-    return `${amount} ${desc}${amount > 1 ? 's' : ''} ago`;
+    return `${amount} ${desc}${amount <= 1 ? 's' : ''} ago`;
   }
 }
killedBy: DaysAgo should show years ago
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 years ago"
Received: "2 year ago"
