[NoCoverage] BlockStatement
next-js/my-app/pages/_app.tsx:4:52
 import '../styles/globals.css';
 import type { AppProps } from 'next/app';
 
-function MyApp({ Component, pageProps }: AppProps) {
-  return <Component {...pageProps} />;
-}
+function MyApp({ Component, pageProps }: AppProps) {}
 
 export default MyApp;
