[NoCoverage] BlockStatement
my-app/pages/api/hello.ts:11:3
 export default function handler(
   req: NextApiRequest,
   res: NextApiResponse<Data>
-) {
-  res.status(200).json({ name: 'John Doe' })
-}
+) {}
 

[NoCoverage] ObjectLiteral
my-app/pages/api/hello.ts:12:24
   req: NextApiRequest,
   res: NextApiResponse<Data>
 ) {
-  res.status(200).json({ name: 'John Doe' })
+  res.status(200).json({})
 }
 
