[NoCoverage] ArrowFunction
next-js/my-app/pages/index.tsx:29:22
       </section>
       <section>
         <ul>
-          {posts.map(({ date, title, slug }) => (
-            <li className={utilStyles.listItem} key={slug}>
-              <Link href={`/posts/${slug}`}>
-                <a>{title}</a>
-              </Link>
-              <br />
-              <small className={utilStyles.lightText}>
-                <DaysAgo dateString={date} />
-              </small>
-            </li>
-          ))}
+          {posts.map(() => undefined)}
         </ul>
       </section>

[NoCoverage] StringLiteral
next-js/my-app/pages/index.tsx:31:27
         <ul>
           {posts.map(({ date, title, slug }) => (
             <li className={utilStyles.listItem} key={slug}>
-              <Link href={`/posts/${slug}`}>
+              <Link href={``}>
                 <a>{title}</a>
               </Link>

[NoCoverage] BlockStatement
next-js/my-app/pages/index.tsx:46:71
   );
 }
 
-export async function getStaticProps(): Promise<{ props: HomeProps }> {
-  const posts = getSortedPostsData();
-  return { props: { posts } };
-}
+export async function getStaticProps(): Promise<{ props: HomeProps }> {}
 

[NoCoverage] ObjectLiteral
next-js/my-app/pages/index.tsx:48:19
 
 export async function getStaticProps(): Promise<{ props: HomeProps }> {
   const posts = getSortedPostsData();
-  return { props: { posts } };
+  return { props: {} };
 }
 
