[Killed] BlockStatement
my-app/pages/posts/[slug].tsx:17:51
   post: RenderedMarkdownDocument | undefined;
 }
 
-export default function Post({ post }: PostProps) {
-  return (
-    <Layout>
-      {post ? (
-        <>
-          <Head>
-            <title>{post.title}</title>
-          </Head>
-          <h1>{post.title}</h1>
-          <p className={utilStyles.lead}>By {post.author}, <Date dateString={post.date}></Date></p>
-          <div data-testid="content" dangerouslySetInnerHTML={{ __html: post.contentHtml }} />
-        </>
-      ) : (
-        <p>404 - not found</p>
-      )}
-      <h2>
-        <Link href="/">
-          <a>Back to home</a>
-        </Link>
-      </h2>
-    </Layout>
-  );
-}
+export default function Post({ post }: PostProps) {}
 
 export const getStaticPaths: GetStaticPaths = () => {
killedBy: Post renders the markdown content
statusReason: Error: Unable to find an element by: [data-testid="content"]

Ignored nodes: comments, <script />, <style />
<body>
  <div />
</body>

[NoCoverage] BlockStatement
my-app/pages/posts/[slug].tsx:41:53
   );
 }
 
-export const getStaticPaths: GetStaticPaths = () => {
-  const posts = getSortedPostsData();
-
-  return {
-    paths: posts.map(({ slug }) => ({ params: { slug } })),
-    fallback: false,
-  };
-};
+export const getStaticPaths: GetStaticPaths = () => {};
 export const getStaticProps: GetStaticProps<
   PostProps,

[NoCoverage] ObjectLiteral
my-app/pages/posts/[slug].tsx:44:10
 export const getStaticPaths: GetStaticPaths = () => {
   const posts = getSortedPostsData();
 
-  return {
-    paths: posts.map(({ slug }) => ({ params: { slug } })),
-    fallback: false,
-  };
+  return {};
 };
 export const getStaticProps: GetStaticProps<

[NoCoverage] ArrowFunction
my-app/pages/posts/[slug].tsx:45:22
   const posts = getSortedPostsData();
 
   return {
-    paths: posts.map(({ slug }) => ({ params: { slug } })),
+    paths: posts.map(() => undefined),
     fallback: false,
   };

[NoCoverage] ObjectLiteral
my-app/pages/posts/[slug].tsx:45:47
   const posts = getSortedPostsData();
 
   return {
-    paths: posts.map(({ slug }) => ({ params: { slug } })),
+    paths: posts.map(({ slug }) => ({ params: {} })),
     fallback: false,
   };

[NoCoverage] BooleanLiteral
my-app/pages/posts/[slug].tsx:46:15
 
   return {
     paths: posts.map(({ slug }) => ({ params: { slug } })),
-    fallback: false,
+    fallback: true,
   };
 };

[NoCoverage] BlockStatement
my-app/pages/posts/[slug].tsx:52:27
 export const getStaticProps: GetStaticProps<
   PostProps,
   { slug: string }
-> = async ({ params }) => {
-  const post = await getPostData(params!.slug);
-  return { props: { post } };
-};
+> = async ({ params }) => {};
 
