[Survived] StringLiteral
next-js/my-app/components/layout.tsx:8:14
 import Link from 'next/link';
 import { PropsWithChildren } from 'react';
 
-const name = 'Nico Jansen';
+const name = "";
 export const siteTitle = "Nico's blog";
 

[Survived] ConditionalExpression
next-js/my-app/components/layout.tsx:68:8
         )}
       </header>
       <main>{children}</main>
-      {!home && (
-        <div className={styles.backToHome}>
-          <Link href="/">
-            <a>← Back to home</a>
-          </Link>
-        </div>
-      )}
+      {true}
     </div>
   );

[Survived] LogicalOperator
next-js/my-app/components/layout.tsx:68:8
         )}
       </header>
       <main>{children}</main>
-      {!home && (
-        <div className={styles.backToHome}>
-          <Link href="/">
-            <a>← Back to home</a>
-          </Link>
-        </div>
-      )}
+      {!home || <div className={styles.backToHome}>
+          <Link href="/">
+            <a>← Back to home</a>
+          </Link>
+        </div>}
     </div>
   );
